In [1]:
import pandas as pd

In [2]:
print(pd.__version__)

1.4.1

In [3]:
pd.__version__

'1.4.1'

In [4]:
OBJ = pd.Series([1,2,3,4])
print(OBJ)

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
print(OBJ.index) #mendeskripsikan dari index yang ada. Start dia include, dan stop dia exclude
print(OBJ.values) #menampilkan suatu value dri OBJ
print(OBJ[1]) #menampilkan index pertama

RangeIndex(start=0, stop=4, step=1)
[1 2 3 4]
2

In [6]:
OBJ_2 = pd.Series(["Rendika","Sigit","Thesion","Irma","Nanda"], index=["R","S","T","I","N"])
print(OBJ_2.index)
print(OBJ_2["R":"I"])
print("")
print(OBJ_2["N"])
print("")
print(OBJ_2[:"N"])

Index(['R', 'S', 'T', 'I', 'N'], dtype='object')
R    Rendika
S      Sigit
T    Thesion
I       Irma
dtype: object

Nanda

R    Rendika
S      Sigit
T    Thesion
I       Irma
N      Nanda
dtype: object

In [7]:
OBJ_3 = pd.Series([-1,-2,-3,4,5,6])
OBJ_3

0   -1
1   -2
2   -3
3    4
4    5
5    6
dtype: int64

In [8]:
print(OBJ_3[OBJ_3>0])

3    4
4    5
5    6
dtype: int64

In [9]:
data = {"Name" : ["Rendika","Sigit","Irma"],
        "Gender" : ["Laki","Laki","Perempuan"],
        "NIM" : [11,5,2]}
frame = pd.DataFrame(data, columns = ["Name","Gender","NIM"], index = ["Zero","One","Two"])
frame

         Name     Gender  NIM
Zero  Rendika       Laki   11
One     Sigit       Laki    5
Two      Irma  Perempuan    2

In [10]:
data = {"state" : ["Ohio","Ohio","Ohio","Nevada","Nevada","Nevada"],
        "year" : [2000,2001,2002,2001,2002,2003],
        "pop" : [1.5,1.7,3.6,2.4,2.9,3.2]}
frame = pd.DataFrame(data, columns=["year","state","pop","number"], 
                     index = ["Zero","One","Two","Three","Four","Five"])
frame

       year   state  pop number
Zero   2000    Ohio  1.5    NaN
One    2001    Ohio  1.7    NaN
Two    2002    Ohio  3.6    NaN
Three  2001  Nevada  2.4    NaN
Four   2002  Nevada  2.9    NaN
Five   2003  Nevada  3.2    NaN

In [11]:
frame.head()

       year   state  pop number
Zero   2000    Ohio  1.5    NaN
One    2001    Ohio  1.7    NaN
Two    2002    Ohio  3.6    NaN
Three  2001  Nevada  2.4    NaN
Four   2002  Nevada  2.9    NaN

In [12]:
frame.loc["Three"]

year        2001
state     Nevada
pop          2.4
number       NaN
Name: Three, dtype: object

In [13]:
frame["state"]

Zero       Ohio
One        Ohio
Two        Ohio
Three    Nevada
Four     Nevada
Five     Nevada
Name: state, dtype: object

In [14]:
frame.year

Zero     2000
One      2001
Two      2002
Three    2001
Four     2002
Five     2003
Name: year, dtype: int64

In [15]:
import numpy as np
import random 
frame["number"] = np.arange(6)
# frame["number"] = np.arange(6)
frame

       year   state  pop  number
Zero   2000    Ohio  1.5       0
One    2001    Ohio  1.7       1
Two    2002    Ohio  3.6       2
Three  2001  Nevada  2.4       3
Four   2002  Nevada  2.9       4
Five   2003  Nevada  3.2       5

In [16]:
val = pd.Series([-1.2,-1.5,-1.7], index = ["Two","Four","Five"])
frame["number"] = val
frame

       year   state  pop  number
Zero   2000    Ohio  1.5     NaN
One    2001    Ohio  1.7     NaN
Two    2002    Ohio  3.6    -1.2
Three  2001  Nevada  2.4     NaN
Four   2002  Nevada  2.9    -1.5
Five   2003  Nevada  3.2    -1.7

In [17]:
frame["eastern"] = frame.state=="Ohio"
frame
del frame["eastern"]
frame

       year   state  pop  number
Zero   2000    Ohio  1.5     NaN
One    2001    Ohio  1.7     NaN
Two    2002    Ohio  3.6    -1.2
Three  2001  Nevada  2.4     NaN
Four   2002  Nevada  2.9    -1.5
Five   2003  Nevada  3.2    -1.7

In [18]:
pop = {"Nevada" : {2001:2.4,2002:2.9}, "Ohio" : {2000:1.5,2001:1.7,2002:3.6}}
frame2 = pd.DataFrame(pop)
frame2

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [19]:
frame2.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [20]:
frame2.index.name = "year";frame2.columns.name = "state"
frame2

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [21]:
obj_4 = pd.Series(range(3), index = ["a","b","c"])
obj_4["a":"b"]

a    0
b    1
dtype: int64

In [22]:
Index = pd.Index(np.arange(1,4))
Index

Int64Index([1, 2, 3], dtype='int64')

In [23]:
obj_5 = pd.Series(["Rendika","Jordi","Melvern"], index = Index)
obj_5

1    Rendika
2      Jordi
3    Melvern
dtype: object

In [24]:
Index_dup = pd.Index(["First","First", "Second", "Second"]) #BISA INDEX DUPLICATE
obj_6 = pd.Series(["Rendika","Jordi","Melvern","Joshua"], index = Index_dup)
obj_6

First     Rendika
First       Jordi
Second    Melvern
Second     Joshua
dtype: object